# Brewfile for Trevor's Development Environment
# Generated for macOS development setup

# Tap additional repositories
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"

# Essential command line tools
brew "git"
brew "curl"
brew "wget"
brew "jq"
brew "yq"
brew "tree"
brew "htop"
brew "neofetch"
brew "bat"
brew "exa"
brew "fd"
brew "ripgrep"
brew "fzf"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "zsh-completions"

# Development languages and runtimes
brew "node"
brew "python@3.11"
brew "python@3.12"
brew "go"
brew "rust"
brew "ruby"
brew "php"

# Package managers
# brew "npm" - Manage with Mise 
brew "yarn"
# brew "pnpm" - Manage with Mise
brew "pipenv"
brew "poetry"
brew "cargo"
brew "gem"

# Version managers
# brew "nvm" - Use Mise
brew "pyenv"
brew "rbenv"
brew "gvm"

# Database tools
brew "postgresql@15"
brew "mysql"
brew "redis"
brew "mongodb/brew/mongodb-community"
brew "sqlite"

# Development tools
brew "docker"
brew "docker-compose"
brew "kubernetes-cli"
brew "helm"
brew "terraform"
brew "ansible"
brew "vagrant"
brew "virtualbox"

# Git tools
brew "gh"
brew "git-delta"
brew "lazygit"
brew "tig"

# Text editors and IDEs
brew "vim"
brew "neovim"
brew "emacs"

# Terminal and shell tools
brew "tmux"
brew "screen"
brew "mosh"
brew "ssh-copy-id"

# Network and security tools
brew "nmap"
brew "wireshark"
brew "openssl"
brew "gnupg"
brew "pass"

# Media and graphics
brew "imagemagick"
brew "ffmpeg"
brew "youtube-dl"

# System utilities
brew "mas"
brew "coreutils"
brew "findutils"
brew "gnu-sed"
brew "gnu-tar"
brew "grep"
brew "proxychains-ng"

# Fonts - Nerd Fonts for terminal and development
cask "font-0xproto-nerd-font"
cask "font-3270-nerd-font"
cask "font-adwaita-mono-nerd-font"
cask "font-agave-nerd-font"
cask "font-anonymice-nerd-font"
cask "font-arimo-nerd-font"
cask "font-atkynson-mono-nerd-font"
cask "font-aurulent-sans-mono-nerd-font"
cask "font-bigblue-terminal-nerd-font"
cask "font-bitstream-vera-sans-mono-nerd-font"
cask "font-blex-mono-nerd-font"
cask "font-caskaydia-cove-nerd-font"
cask "font-caskaydia-mono-nerd-font"
cask "font-code-new-roman-nerd-font"
cask "font-comic-shanns-mono-nerd-font"
cask "font-commit-mono-nerd-font"
cask "font-cousine-nerd-font"
cask "font-d2coding-nerd-font"
cask "font-daddy-time-mono-nerd-font"
cask "font-dejavu-sans-mono-nerd-font"
cask "font-departure-mono-nerd-font"
cask "font-droid-sans-mono-nerd-font"
cask "font-envy-code-r-nerd-font"
cask "font-fantasque-sans-mono-nerd-font"
cask "font-fira-code-nerd-font"
cask "font-fira-mono-nerd-font"
cask "font-geist-mono-nerd-font"
cask "font-go-mono-nerd-font"
cask "font-gohufont-nerd-font"
cask "font-hack-nerd-font"
cask "font-hasklug-nerd-font"
cask "font-heavy-data-nerd-font"
cask "font-hurmit-nerd-font"
cask "font-im-writing-nerd-font"
cask "font-inconsolata-go-nerd-font"
cask "font-inconsolata-lgc-nerd-font"
cask "font-inconsolata-nerd-font"
cask "font-intone-mono-nerd-font"
cask "font-iosevka-nerd-font"
cask "font-iosevka-term-nerd-font"
cask "font-iosevka-term-slab-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-lekton-nerd-font"
cask "font-liberation-nerd-font"
cask "font-lilex-nerd-font"
cask "font-m+-nerd-font"
cask "font-martian-mono-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "font-monaspice-nerd-font"
cask "font-monocraft-nerd-font"
cask "font-monofur-nerd-font"
cask "font-monoid-nerd-font"
cask "font-mononoki-nerd-font"
cask "font-noto-nerd-font"
cask "font-open-dyslexic-nerd-font"
cask "font-overpass-nerd-font"
cask "font-profont-nerd-font"
cask "font-proggy-clean-tt-nerd-font"
cask "font-recursive-mono-nerd-font"
cask "font-roboto-mono-nerd-font"
cask "font-sauce-code-pro-nerd-font"
cask "font-sf-mono-nerd-font-ligaturized"
cask "font-shure-tech-mono-nerd-font"
cask "font-space-mono-nerd-font"
cask "font-symbols-only-nerd-font"
cask "font-terminess-ttf-nerd-font"
cask "font-tinos-nerd-font"
cask "font-ubuntu-mono-nerd-font"
cask "font-ubuntu-nerd-font"
cask "font-ubuntu-sans-nerd-font"
cask "font-victor-mono-nerd-font"
cask "font-zed-mono-nerd-font"

# Popular development applications
cask "visual-studio-code"
cask "cursor"
cask "iterm2"
cask "alfred"
cask "raycast"
cask "docker"
cask "postman"
cask "insomnia"
cask "tableplus"
cask "sequel-pro"
cask "dbeaver-community"
cask "mongodb-compass"
cask "redisinsight"

# Productivity applications
cask "notion"
cask "obsidian"
cask "typora"
cask "mark-text"
cask "slack"
cask "discord"
cask "zoom"
cask "figma"

# System utilities
cask "cleanmymac"
cask "little-snitch"
cask "karabiner-elements"
cask "rectangle"
cask "alt-tab"
cask "stats"
cask "istat-menus"

# Media applications
cask "vlc"
cask "spotify"
cask "handbrake"
cask "gimp"
cask "inkscape"

# Browser
cask "google-chrome"
cask "firefox"
cask "brave-browser"
cask "arc"

# Mac App Store applications (requires mas-cli)
# Uncomment and add your App Store app IDs
# mas "Xcode", id: 497799835
# mas "The Unarchiver", id: 425424353
# mas "Magnet", id: 441258766
# mas "CleanMyMac X", id: 1333542190
